export const inputEmailPattern = {
  value: /\S+@\S+\.\S+/,
  message: 'Не соответствует формату электронной почты',
};

export const inputPhonePattern = {
  value: /^[\+]?[(]?[0-9]{3}[)]?[-\s\.]?[0-9]{3}[-\s\.]?[0-9]{4,6}$/,
  message: 'Не соответствует формату номера телефона',
};

export const inputPassPattern = {
  value: /(?=.*[0-9])(?=.*[!@#$%^&*])(?=.*[a-z])(?=.*[A-Z])/g,
  message:
    'Пароль должен состоять из строчных, заглавных латинских букв, цифр и спец символов, не менее 10 символов длиной',
};
